#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>


int main(void)
{
	//배열명: 배열 '첫 번째 요소'의 주소(단, 변수가 아니고 상수이다)
	//배열명이 가리키는 자료형: 첫 번째 배열 요소의 자료형
	//배열명의 자료형: (첫번째 요소의 자료형)*

	//int a[5] = { 10, 20, 30, 40, 50 };
	//printf("배열명=%p\n", a);
	//printf("첫 번재 원소의 주소=%p\n", &a[0]);
	//printf("*a=%d", *a);//이거는 a라는 변수명의 값. 아마 10이 출력되지 않을까?
	//printf("a[0]=%d", a[0]);
	//return 0;
//int* p;
//	p = (int*)1000;
//	p = p + 1;
//	p = p - 2;
//	printf("%d", *p);


	int arr[3] = { 11, 22, 33 };
	printf("%d, %d, %d\n", *arr, *(arr + 1), *(arr + 2));//이 부분이 가장 헷갈리는데(일단은 이해했지만 혹시 모르니 다음에 한번 더 보도록 하자.), 이해한대로 정리해보자면 우선 첫 번째, *arr의 경우 a[0]이 있는 주소로 가서 값을 가져오라는 의미이므로 11을 출력할 것이다. 두 번째, *(arr+1)의 경우 a[0]으로부터 한 칸 떨어진 곳, 배열의 자료형이 int형(4바이트)였으니 4바이트 떨어진 곳인 a[1]을 의미하므로 22를 출력할 것이다. 마지막으로, *(arr+2)의 경우 a[0]으로부터 두 칸, 즉 약 8바이트(4바이트 + 4바이트) 떨어진 곳을 의미하므로 arr[2]를 의미한다. 그러므로 33을 출력 할 것이다.
	return 0;
	
}
