#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

//스트림: 데이터가 흐르는 길로, 서로 다른 장치를 똑같은 방식으로 다루게 해주는 것이다.
//스트림의 종류로는 입력장치에서 응용프로그램으로 이어지는 입력 스트림, 응용프로그램에서 출력장치로 이어지는 출력 스트림이 있다.

//버퍼: 입출력 장치와 프로그램 사이에 존재하는, 데이터를 임시로 저장하는 메모리 공간.
//버퍼를 사용하는 이유는 데이터를 한 번에 전송하는 것이 효율적이기 때문이다.
//그러나 단점도 존재한다. 버퍼를 사용하는 경우 프로그램이 비정상적으로 종료되었을 경우 데이터가 날아갈 수 있다는 것이다.

//printf() 함수는 모니터에 출력하는 게 아니라 출력 버퍼에 데이터를 출력하는 것이다. 출력 버퍼에서 모니터로 전송하는 것은 운영체제의 역할이다.
//scanf() 함수는 데이터를 입력 버퍼에 전달하는 게 아니라 입력 버퍼에 있는 데이터를 응용프로그램에 전달하는 것이다. 입력 장치에서 입력 버퍼로 데이터를 전송하는 것은 운영체제의 역할이다.
//이런 성질 때문에, scanf() 함수의 경우 이미 입력 버퍼에 데이터가 있을 때 scanf() 함수를 실행한다면 새 데이터를 입력받는 것이 아니라 기존에 입력 버퍼에 있는 데이터를 응용프로그램에 전달하고 작업을 끝낸다(return 한다)
